Revit 2024 API
BuiltInFailures.MEPCalculationFailures.PipePressureDropCalculatorNotAvailable Property
 Pipe Pressure Drop Calculator Not Available: [Calculator Name]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PipePressureDropCalculatorNotAvailable { get; }
Visual Basic
Public Shared ReadOnly Property PipePressureDropCalculatorNotAvailable As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PipePressureDropCalculatorNotAvailable {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace